{
    "peft_type": "LORA",
    "r": 16,
    "lora_alpha": 8,
    "target_modules": [
        "q_proj",
        "k_proj",
        "v_proj",
        "o_proj",
        "gate_proj",
        "up_proj",
        "down_proj"
    ],
    "base_model_name_or_path": "Qwen/Qwen2.5-Coder-0.5B-Instruct"
}