{
    "peft_type": "LORA",
    "r": 16,
    "lora_alpha": 32,
    "target_modules": [
        "q_proj",
        "v_proj"
    ],
    "base_model_name_or_path": "stabilityai/stable-diffusion-xl-base-1.0"
}